index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>index</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="index"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-08-01T15:02+0800"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">index</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 My web space</a></li>
<li><a href="#sec-2">2 Tech</a>
<ul>
<li><a href="#sec-2-1">2.1 ROR tips</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 Rails Basic Commands</a></li>
<li><a href="#sec-2-1-2">2.1.2 rails tips</a></li>
<li><a href="#sec-2-1-3">2.1.3 sqlite3 concole</a></li>
<li><a href="#sec-2-1-4">2.1.4 Install toolkits for Windwos(like mysys/cygwin)</a></li>
<li><a href="#sec-2-1-5">2.1.5 railsinstaller for Windows(includes bash/git/rubyonrail)</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 emacs</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 emacs setup &amp; configuration</a></li>
<li><a href="#sec-2-2-2">2.2.2 emacs common command</a></li>
<li><a href="#sec-2-2-3">2.2.3 Dired cheatsheet</a></li>
<li><a href="#sec-2-2-4">2.2.4 difficults</a></li>
<li><a href="#sec-2-2-5">2.2.5 emacs FAQ</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> My web space</h2>
<div class="outline-text-2" id="text-1">

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Tech</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> ROR tips</h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Rails Basic Commands</h4>
<div class="outline-text-4" id="text-2-1-1">

<ul>
<li>rails new depot
</li>
<li>rake db:migrate
</li>
<li>rails g scaffold Product title:string des:text image<sub>url</sub>:string price:decimal
</li>
<li>rails g scaffold cart
</li>
<li>rails g scaffold line<sub>item</sub> product<sub>id</sub>:integer cart<sub>id</sub>:interger
</li>
<li>rails g scaffold order name:string address:text email:string pay<sub>type</sub>:string
</li>
<li>rails g controller store index
</li>
<li>rails g migration add<sub>quantity</sub><sub>to</sub><sub>line</sub><sub>item</sub> quantity:integer
</li>
<li>rails g migration combine<sub>items</sub><sub>in</sub><sub>cart</sub>
</li>
<li>rails g migration add<sub>order</sub><sub>id</sub><sub>to</sub><sub>line</sub><sub>item</sub> order<sub>id</sub>:integer
</li>
<li>rails g migration add<sub>order</sub><sub>id</sub><sub>and</sub><sub>other</sub><sub>to</sub><sub>line</sub><sub>item</sub> order<sub>id</sub>:inter other:string
</li>
<li>rails server
</li>
<li>rake db:seed / db:migrate / db:rollback
</li>
<li>rake test:units / test:functionals
</li>
</ul>

</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> rails tips</h4>
<div class="outline-text-4" id="text-2-1-2">

<ul>
<li>add colume to table(delete old migrate,delete db,g scaffold) 
</li>
</ul>

</div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> sqlite3 concole</h4>
<div class="outline-text-4" id="text-2-1-3">

<ul>
<li>sqlite3 -line db/development.sqlite3
</li>
<li>.tables
</li>
<li>select * from orders
</li>
<li>select * from line<sub>items</sub>
</li>
<li>.quit
</li>
</ul>

</div>

</div>

<div id="outline-container-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> Install toolkits for Windwos(like mysys/cygwin)</h4>
<div class="outline-text-4" id="text-2-1-4">

</div>

</div>

<div id="outline-container-2-1-5" class="outline-4">
<h4 id="sec-2-1-5"><span class="section-number-4">2.1.5</span> railsinstaller for Windows(includes bash/git/rubyonrail)</h4>
<div class="outline-text-4" id="text-2-1-5">

</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> emacs</h3>
<div class="outline-text-3" id="text-2-2">


</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> emacs setup &amp; configuration</h4>
<div class="outline-text-4" id="text-2-2-1">

<p>1.Home:D:/Design
2.Path:
3.purcell's emacs.d( disable ;;require 'init<sub>growl</sub>.el)
4.use git bash(default is fly sh?)
</p>
</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> emacs common command</h4>
<div class="outline-text-4" id="text-2-2-2">

<ul>
<li>window
</li>
<li>C-x o: switch windows
</li>
<li>C-x 0: close current window

</li>
<li>Select Copy Paste
</li>
<li>C-@: Mark Set Start, then move to the end
</li>
<li>C-w: Cut
</li>
<li>M-w: Copy
</li>
<li>C-y: Paste
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> Dired cheatsheet</h4>
<div class="outline-text-4" id="text-2-2-3">

<ul>
<li>cursoner move:
</li>
<li>n: next line
</li>
<li>p: prev line
</li>
<li>q: back; ^: parent dir;
</li>
<li>ent: enter into the subdir
</li>
<li>i: list subdir below
</li>
<li>$: hide subdir(toggle)
</li>
<li>C-u-k: hide subdir forever
</li>
<li>m: mark current file
</li>
<li>u: unmark file
</li>
<li>k: hide marked file
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> difficults</h4>
<div class="outline-text-4" id="text-2-2-4">

<p>Can't run ssh in emacs eshell/git bash on Windows7
</p>
</div>

</div>

<div id="outline-container-2-2-5" class="outline-4">
<h4 id="sec-2-2-5"><span class="section-number-4">2.2.5</span> emacs FAQ</h4>
<div class="outline-text-4" id="text-2-2-5">

<ul>
<li>Q:Dir tree is a good manner to go?
</li>
<li>Q:Dos purcell's .emacs load el after enter the associated mode, why so slow?
</li>
<li>Q:Something uncommfortable:no filetree in Dire+; files info is to long to; no porject manage.
</li>
</ul>

</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-08-01T15:02+0800</p>
<p class="author">Author: </p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
